# 기본적으로 파이썬 및 모든 언어는 정해진 문법이 존재한다.

# 안녕하세요 << 오류 발생!! : 파이썬(컴퓨터가 읽을 수 없기 때문)

# print("안녕하세요") # print("안녕하세요) : 파이썬의 출력 문법을 적용했기 대문에 실행에 문제가 X

# shift 연속 두번 따닥 + wrap 입력 -> 자동 줄바꿈(개행) 이 가능하다.

# 주석 : 주석은 #으로 시작한다. #으로 시작

# print("안녕하세요")
# print("반갑습니다")
# print("저는 박원민 입니다.")
# print("저는 대구에 살고있어요")
# print("저는 한국인 입니다.")

# 주석단축키 : ctrl + ?키

# print : 명령어 : run에 출력을 하라는 명령
# ()목적
# '',"" => 문자열 파이썬은 '' "" 구분 X

# print('10') # '' , "" 가 들어간 순간 10은 숫자가 아니라 문자열로 구분이 된다.

# print() # 아무것도 입력하지 않으면 단순하게 줄바꿈 합니다.

# 여러 개를 출력 가능하다.
# print('10', 10 + 20)

print('안녕 파이썬')
print('앞으로 잘 부탁해')

print('안녕 파이썬!\n앞으로 잘 부탁해!') # 개행문자 \n







